benchmarks/products-4-replica-400-conn-1-th.log
Running 30s test @ http://localhost/products
  1 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   385.02ms  364.10ms   1.96s    74.91%
    Req/Sec     0.96k   477.99     2.66k    69.72%
  10631 requests in 13.58s, 14.98MB read
  Socket errors: connect 0, read 0, write 0, timeout 400
Requests/sec:    782.88
Transfer/sec:      1.10MB
Running 30s test @ http://localhost/products
  1 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   327.58ms  256.31ms   1.74s    70.83%
    Req/Sec     1.32k   418.38     2.68k    67.00%
  39571 requests in 30.11s, 55.78MB read
  Socket errors: connect 0, read 0, write 0, timeout 34
Requests/sec:   1314.10
Transfer/sec:      1.85MB
Running 30s test @ http://localhost/products
  1 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   338.75ms  278.96ms   1.89s    73.22%
    Req/Sec     1.33k   453.85     2.93k    69.33%
  39789 requests in 30.07s, 56.08MB read
  Socket errors: connect 0, read 0, write 0, timeout 2
Requests/sec:   1323.14
Transfer/sec:      1.87MB
Running 30s test @ http://localhost/products
  1 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   337.75ms  279.77ms   1.74s    71.32%
    Req/Sec     1.33k   439.08     2.74k    71.24%
  39580 requests in 30.07s, 55.79MB read
  Socket errors: connect 0, read 0, write 0, timeout 29
Requests/sec:   1316.05
Transfer/sec:      1.86MB
Running 30s test @ http://localhost/products
  1 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   323.04ms  249.77ms   1.90s    72.06%
    Req/Sec     1.36k   431.41     2.88k    71.57%
  40480 requests in 30.07s, 57.06MB read
  Socket errors: connect 0, read 0, write 0, timeout 5
Requests/sec:   1346.30
Transfer/sec:      1.90MB
Running 30s test @ http://localhost/products
  1 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   365.25ms  334.49ms   2.00s    77.03%
    Req/Sec     1.31k   458.01     2.96k    72.88%
  38535 requests in 30.09s, 54.32MB read
  Socket errors: connect 0, read 0, write 0, timeout 52
Requests/sec:   1280.74
Transfer/sec:      1.81MB
Running 30s test @ http://localhost/products
  1 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   309.94ms  193.26ms   1.36s    69.68%
    Req/Sec     1.27k   473.76     3.36k    70.88%
  33257 requests in 30.09s, 46.88MB read
  Socket errors: connect 0, read 0, write 0, timeout 400
Requests/sec:   1105.19
Transfer/sec:      1.56MB
Running 30s test @ http://localhost/products
  1 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   306.02ms  185.40ms   1.64s    68.18%
    Req/Sec     1.34k   396.63     2.73k    71.33%
  40131 requests in 30.08s, 56.57MB read
Requests/sec:   1334.04
Transfer/sec:      1.88MB
Running 30s test @ http://localhost/products
  1 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   303.73ms  176.46ms   1.57s    68.68%
    Req/Sec     1.35k   451.48     3.66k    73.91%
  40274 requests in 30.02s, 56.77MB read
Requests/sec:   1341.54
Transfer/sec:      1.89MB
Running 30s test @ http://localhost/products
  1 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   298.57ms  162.49ms   1.53s    67.50%
    Req/Sec     1.36k   454.01     2.62k    70.13%
  40454 requests in 30.08s, 57.02MB read
Requests/sec:   1344.72
Transfer/sec:      1.90MB
Running 30s test @ http://localhost/products
  1 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   293.94ms  155.79ms   1.29s    70.31%
    Req/Sec     1.38k   548.58     3.62k    69.67%
  41361 requests in 30.09s, 58.30MB read
Requests/sec:   1374.42
Transfer/sec:      1.94MB